<template>
  <div class="principal">
    <h1>Seja bem-vindo</h1>
    <h2>Atualização monetária- INPC</h2>
    <label for="data">Data:</label>
    <input type="text" name="data" placeholder="Digite a data" />
    <label for="valor">Valor:</label>
    <input type="text" name="valor" placeholder="Digite o valor" />
    <button type="submit">Calcular</button>
    <label for="valorAtual">Valor atualizado:</label>
    <input type="text" name="valorAtual" />
  </div>
</template>

<script>
export default {
  name: "CalculadoraInpc",
  data() {
    return {
      valores: [
        {
          1994: {
            mes: [
              0.65, 1.29, 1.28, 0.47, 0.05, 0.07, 0.74, 0.55, 0.39, 0.96, 0.94,
              0.74,
            ],
          },
          1995: {
            mes: [
              1.44, 1.01, 1.62, 2.49, 2.1, 2.18, 2.46, 1.02, 1.17, 1.4, 1.51,
              1.65,
            ],
          },
          1996: {
            mes: [
              1.46, 0.71, 0.29, 0.93, 1.28, 1.33, 1.2, 0.5, 0.02, 0.38, 0.34,
              0.33,
            ],
          },
          1997: {
            mes: [
              0.81, 0.45, 0.68, 0.6, 0.11, 0.35, 0.18, -0.03, 0.1, 0.29, 0.15,
              0.57,
            ],
          },
          1998: {
            mes: [
              0.85, 0.54, 0.49, 0.45, 0.72, 0.15, -0.28, -0.49, -0.31, 0.11,
              -0.18, 0.42,
            ],
          },
          1999: {
            mes: [
              0.65, 1.29, 1.28, 0.47, 0.05, 0.07, 0.74, 0.55, 0.39, 0.96, 0.94,
              0.74,
            ],
          },
          2000: {
            mes: [
              0.61, 0.05, 0.13, 0.09, -0.05, 0.3, 1.39, 1.21, 0.43, 0.16, 0.29,
              0.55,
            ],
          },
          2001: {
            mes: [
              0.77, 0.49, 0.48, 0.84, 0.57, 0.6, 1.11, 0.79, 0.44, 0.94, 1.29,
              0.74,
            ],
          },
          2002: {
            mes: [
              1.07, 0.31, 0.62, 0.68, 0.09, 0.61, 1.15, 0.86, 0.83, 1.57, 3.39,
              2.7,
            ],
          },
          2003: {
            mes: [
              2.47, 1.46, 1.37, 1.38, 0.99, -0.06, 0.04, 0.18, 0.82, 0.39, 0.37,
              0.54,
            ],
          },
          2004: {
            mes: [
              0.83, 0.39, 0.57, 0.41, 0.4, 0.5, 0.73, 0.5, 0.17, 0.17, 0.44,
              0.86,
            ],
          },
          2005: {
            mes: [
              0.57, 0.44, 0.73, 0.91, 0.7, -0.11, 0.03, 0.0, 0.15, 0.58, 0.54,
              0.4,
            ],
          },
          2006: {
            mes: [
              0.38, 0.23, 0.27, 0.12, 0.13, -0.07, 0.11, -0.02, 0.16, 0.43,
              0.42, 0.62,
            ],
          },
          2007: {
            mes: [
              0.49, 0.42, 0.44, 0.26, 0.26, 0.31, 0.32, 0.59, 0.25, 0.3, 0.43,
              0.97,
            ],
          },
          2008: {
            mes: [
              0.69, 0.48, 0.51, 0.64, 0.96, 0.91, 0.58, 0.21, 0.15, 0.5, 0.38,
              0.29,
            ],
          },
          2009: {
            mes: [
              0.64, 0.31, 0.2, 0.55, 0.6, 0.42, 0.23, 0.08, 0.16, 0.24, 0.37,
              0.24,
            ],
          },
          2010: {
            mes: [
              0.88, 0.7, 0.71, 0.73, 0.43, -0.11, -0.07, -0.07, 0.54, 0.92,
              1.03, 0.6,
            ],
          },
        },
      ],
    };
  },
};
</script>

<style>
.principal {
  font-family: Arial, Helvetica, sans-serif;
  text-align: center;
  /*width: 490px;*/
  margin: auto;
  margin-top: 100px;
  padding: 5px;
  background-color: rgb(181, 191, 202);
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  line-height: 50px;
}
</style>